FI/Kertomustiedot/Integraatiopalvelu_Kertomustiedot_Esimerkkisanoma_InsertEPRData_Request_2.0.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:Tieto.HCW.EIS.EPRDocumentService.ServiceContracts" xmlns:urn1="urn:Tieto.HCW.EIS.EPRDocumentService.WCFService" xmlns:tiet="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon" xmlns:tiet1="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.EPRDocumentService.DataContracts">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:InsertEPRDataRequest>
         <!--Optional:-->
         <urn1:MessageHeader>
            <!--Optional:-->
            <!--type: string-->
            <tiet:MessageID>gero et</tiet:MessageID>
            <!--Optional:-->
            <!--type: string-->
            <tiet:TransactionID>sonoras imperio</tiet:TransactionID>
            <!--Optional:-->
            <!--type: string-->
            <tiet:SenderID>quae divum incedo</tiet:SenderID>
            <!--Optional:-->
            <!--type: string-->
            <tiet:SenderApplication>verrantque per auras</tiet:SenderApplication>
            <!--type: string-->
            <tiet:ReceiverID>per auras</tiet:ReceiverID>
            <!--Optional:-->
            <!--type: string-->
            <tiet:ReceiverApplication>circum claustra</tiet:ReceiverApplication>
            <!--Optional:-->
            <!--type: string-->
            <tiet:CharacterSet>nimborum in</tiet:CharacterSet>
            <!--Optional:-->
            <!--type: string-->
            <tiet:DataServiceURL>foedere certo</tiet:DataServiceURL>
            <!--Optional:-->
            <!--type: string-->
            <tiet:UserLanguageCode>profundum quippe ferant</tiet:UserLanguageCode>
            <!--Optional:-->
            <!--type: string-->
            <tiet:VersionNumber>et carcere</tiet:VersionNumber>
         </urn1:MessageHeader>
         <!--Optional:-->
         <urn1:Common>
            <!--Optional:-->
            <!--type: string-->
            <tiet:ContractKey>yyy</tiet:ContractKey>
            <!--Optional:-->
            <!--type: string-->
            <tiet:UserId>speluncis abdidit</tiet:UserId>
            <!--Optional:-->
            <!--type: string-->
            <tiet:CallingSystem>xxx</tiet:CallingSystem>
            <!--Optional:-->
            <!--type: string-->
            <tiet:CallingUserId>flammas turbine</tiet:CallingUserId>
         </urn1:Common>
         <!--Optional:-->
         <urn1:Contact>
            <tiet1:PatientId>
               <!--type: string-->
               <tiet1:Identifier>020219-A020</tiet1:Identifier>
            </tiet1:PatientId>
            <!--type: dateTime-->
            <tiet1:VisitTime>2014-06-10T21:33:25+03:00</tiet1:VisitTime>
            <!--type: string-->
            <tiet1:ContactAuthor>tieto</tiet1:ContactAuthor>
            <!--type: string-->
            <tiet1:Organisation>007</tiet1:Organisation>
            <!--type: string-->
            <tiet1:OrgUnit>1200Y</tiet1:OrgUnit>
            <!--type: string-->
            <tiet1:Form>YLE</tiet1:Form>
            <!--type: string-->
            <tiet1:Functionary>esh</tiet1:Functionary>
            <!--Optional:-->
            <!--type: string-->
            <tiet1:Speciality>10</tiet1:Speciality>
            <!--type: DataState - enumeration: [U,F,A]-->
            <tiet1:DataState>U</tiet1:DataState>
            <!--type: CareprocessState - enumeration: [TULOTILANNE,HOIDON_SUUNNITTELU,HOIDON_TOTEUTUS,HOIDON_ARVIOINTI,MAARITTAMATON_HOITOPROSESSIN_VAIHE]-->
            <tiet1:CareprocesState>TULOTILANNE</tiet1:CareprocesState>
            <tiet1:ContactRows>
               <!--Zero or more repetitions:-->
               <tiet1:ContactRow>
                  <!--type: string-->
                  <tiet1:HeadingName>Kuvat</tiet1:HeadingName>
                  <!--type: string-->
                  <tiet1:Data>talia flammato secum</tiet1:Data>
                  <!--Optional:-->
                  <!--type: string-->
                  <tiet1:Value>austris aeoliam</tiet1:Value>
                  <!--Optional:-->
                  <!--type: string-->
                  <tiet1:Specifier>sciret dare</tiet1:Specifier>
               </tiet1:ContactRow>
            </tiet1:ContactRows>
         </urn1:Contact>
      </urn:InsertEPRDataRequest>
   </soapenv:Body>
</soapenv:Envelope>